### **Summary of Cleaning Steps**:
1. **Load the data** into Pandas.
2. **Inspect the data** for structure, summary statistics, and missing values.
3. **Check unique values** to spot inconsistencies in categorical columns.
4. **Handle missing values** by filling or dropping them.
5. **Fix inconsistent text data** by standardizing and correcting typos.
6. **Remove outliers** from the numeric columns like `Salary`.
7. **Standardize date formats** to ensure all dates are in the same format.
8. **Remove duplicate rows** from the dataset.
9. **Inspect the cleaned data** to verify your cleaning process was successful.

**Step 1: Load the Dataset**
- First, load the dataset into Pandas so you can inspect it.

In [3]:
import pandas as pd

# Load the dataset
url = 'https://raw.githubusercontent.com/siddhantbhattarai/Machine_Learning_Bootcamp_2024/refs/heads/main/Pandas/Data_Cleaning/dirty_data.csv'
df = pd.read_csv(url)

# Look at the first few rows of the dataset
print(df.head())

               Name   Age           City   Join_Date     Salary  Gender
0  Savannah Patrick  21.0  san francisco  2024-02-04  9999999.0    Male
1    Jessica Ramsey  32.0             SF  15/03/2022  9999999.0  Female
2       Jacob White  70.0             LA  2019-11-03        NaN  female
3        Erik Ortiz  62.0  San Francisco  2020-06-14       10.0    male
4      Tonya Dudley  42.0             LA  2023-07-21  2000000.0  Female

**Step 2: Inspect the Data**
- Before cleaning the data, you need to understand its structure.

In [4]:
# Check the structure of the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10100 entries, 0 to 10099
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       9077 non-null   object
 1   Age        9067 non-null   float64
 2   City       10100 non-null  object
 3   Join_Date  9102 non-null   object
 4   Salary     7814 non-null   float64
 5   Gender     8853 non-null   object
dtypes: float64(2), object(4)
memory usage: 473.6+ KB

In [33]:
# Check unique values in the 'Gender' column
print("Unique values in 'Gender':", df['Gender'].unique())

Unique values in 'Gender': ['female' 'male' 'unknown']

In [34]:
# Check unique values in the 'City' column
print("Unique values in 'City':", df['City'].unique())

Unique values in 'City': ['New York' 'Los Angeles' 'San Francisco']

In [36]:
# Check unique values in the 'Age' column
print("Unique values in 'Age':", df['Age'].unique())

Unique values in 'Age': [56. 18. 20. 29. 51. 55. 46. 25. 49. 48. 23. 26. 44. 53. 35. 52. 69. 61.
 36. 40. 41. 58. 59. 30. 28. 21. 62. 68. 33. 63. 27. 38. 45. 47. 31. 65.
 50. 37. 54. 19. 64. 32. 67. 22. 34. 24. 66. 60. 39. 70. 43. 42. 57.]

In [37]:
# Check unique values in the 'Salary' column
print("Unique values in 'Salary':", df['Salary'].unique())

Unique values in 'Salary': [173314.07178227  81495.40654824  55726.33882573 199014.30198763
  76552.65584576  89896.50834987  71082.28300614  83976.06313335
 137222.64128248 169592.74583585 173842.26571579 173960.51414453
 113009.42752972 148776.32806803 146442.92794895  57893.90785747
 162618.74033283 154485.98607858  90536.81895635 129803.82604539
 192769.63174184 181452.22197981 164865.58280781 134759.15710204
 112019.17779216 154132.10837113  57770.52333969 120943.03549679
 105320.21159778  94300.60962554  76290.15147695 198645.67769726
  76961.19739935 121726.76692404 122862.03789501  78988.40628727
  82427.81856035 186276.92769749 138316.30618283  78741.75730467
 174667.68164102 142066.82417717  76705.95213665  79611.19280337
 176256.07248117  64639.05277132 174721.56005582 180312.76356623
 125754.02399468 161147.0826596   64902.38535368  79650.09367284
 171174.0363687  164152.06598728 145042.35474669  77383.86499116
 183277.72098242 174612.25452609 190014.84813989  92329.81661242
 107722.67553177 128448.1423176  102777.12653216  50525.39543487
 160922.07863684 112264.88146142 114448.77806041  69633.56257972
 107982.72436593 150334.6461854   81903.55396604 124124.10786333
  98250.34646811  81970.66180417 173673.23225133 182586.07134134
 173721.92998582 149024.43454199 189277.24071033 161516.99499602
 142339.37777503  74701.05009578  98939.3831646   87262.68598423
 159900.10614848 118451.39554306 139284.58975296 195269.25568185
 181382.91052598  99378.05673918  93532.73281262 147256.62984095
 140749.50306718  91311.83704078  79806.4528609  173954.36772665
 197570.66095693 187136.31861814 163601.30193892  61533.30055306
 123801.53810506 145347.73247792 125861.63737822 104629.64840996
 151433.75055492 119713.5352606   84855.82336412  85603.39239281
 176675.83285511 143397.69502084 125621.72354588  94009.02733448
  75600.63701889  71740.09933101 172688.13002413  52476.7904534
  77742.9539578  198896.72041539 178931.17280563 156958.14293729
  57575.15313848 119559.71070417 110457.77826708 181732.26226264
  92275.36823078  52200.92407376 191568.79285715 180510.77444507
 120962.20201961  73684.57371827  53715.22438062 178694.26920432
 196093.67493742 158651.07627448 145004.23332378 192268.8709032
 110465.48202687 151423.07837865  86628.93343082 189671.22570495
  68760.29124704 102168.61891742 174008.08670813 149236.21968965
  79476.09898195 119087.48002776  71019.17236449  63151.52325634
 121796.82595107 114762.08495466 156781.00387815 175468.10937307
 110137.02093641 132413.86575536 100030.09706103 135632.78249392
 194899.64966908 198689.7082014  187358.57333519 168548.9261815
  60750.094975   100579.55159935  96487.34150803 114946.0760955
 135962.91246216 112571.32703505  91754.07135078 180086.04072788
 183571.4617332  149120.41596935  68150.99102001 173109.41943045
 124949.52724599  54836.98624299 157122.25908817 158352.25677005
 150881.0975175   97575.35104715 119471.21056522 161365.18397971
 102298.33973368  96113.05028093  75171.10356184 120066.48737797
  86289.28519502  86058.26714318  91381.26978984 170913.58881324
 174457.00437249 101267.1244761  133067.25635464 139827.55063258
  60508.21271755 133999.14681534  80638.11537898 108026.79596294
 138893.95402996 175759.13258711 108000.06456936 114334.87807104
 188963.18886915  85708.67408592 133875.88885983 114756.45537555
 132474.72013456 178449.74449629  68770.72969937 189410.15149415
 103141.34027963 191731.76365055  51932.91577477 163746.07026415
 139298.60125823 143563.82989635  83659.00360766 190022.75166074
 111733.05326786  74319.67758483 198029.58055311  84891.64640439
 179219.28050471  74614.40976981 105071.99479947 128267.90243087
 133566.85659332 145688.05712811  87773.66529975 145135.83873671
  84885.0986299  151123.48692743 189629.75916537 116031.25569276
  87156.39628286  96690.25917764  96729.2941716  148605.90322772
 159272.49692102  73397.55544749 143420.7739001  147965.88384541
  54750.97122774 140307.40317908 107633.98167666  66257.66385184
  75451.78878869  70432.04503247 181073.11724253 197767.80591876
 147193.38858754  79740.0737587  171460.49138575  70488.82609457
  85110.08414     87139.47921579 106500.51934516 179128.59661032
 106367.57117887  56895.66141724 150187.53184579 106769.06225198
 185374.77195284 192245.71572399 127687.84148927 141869.64836212
 147112.94434805 199433.16530638  67888.57807233 104117.40111301
 107354.09565882 194396.08443948 121556.24571735 192893.40608502
 165537.02880321 103389.67593534  59285.46627093 108475.90929584
  88051.32890203 161321.29090997  96799.57914724 168780.20952484
  72785.22421369 126272.97715896  59464.32728553  58109.16332723
  85886.98620929  56427.76810418 124756.68110193 142511.76081855
 167372.60550564  93556.7712439   63333.24570385 147773.72052765
 131938.83090721  85522.18700186 175049.97202292  81820.45325989
  81582.83908038 170736.20454385 117971.34207246 180749.19275905
  51400.60728759 188687.79694779 180847.8431448  130732.33316511
 183176.54238238  75997.11486409 196627.77167032  76138.61545482
 113101.97527336 101084.39494668  87986.24069805 109223.43826159
 154749.81289274  66426.67653176  98900.3379874  191503.73114509
  91429.25065654 108026.14295688 126333.42119328 151043.76425019
 179084.11354766 114735.87576403 124494.49222409  57503.21502663
 104112.65301966  66682.62906295  72006.99538709 106417.91157042
 169777.06833959 143215.82636588  66526.17054561  78427.6610071
  99141.50353938 159807.21966934 182351.82091996 118325.73487958
 134931.38106708 175118.04427948  88408.33344009  79978.35435678
  73379.46778225  56690.54583389  53113.01214465 120490.45003985
  72065.82782227  89863.41361671 167458.45334532 136238.43475448
 172410.08666393 185599.89473911  84100.68754767 170004.6174624
  78403.70062985 173820.88190174 161007.21582125 132132.37275576
 149303.27848796 189014.69649682 181108.23144331 137675.78914965
  50019.48643363  62897.72852932 197583.47715054 187534.28471792
  95962.6794636  197404.62166642 145224.61018245 142432.98654917
 181917.58508629  63362.31185126 163914.11203796 196395.21667591
 121394.21942454 116295.3362277  141302.75582478 182968.33263396
  66727.49361858 197977.24969059  92002.8326516  113366.16992336
  85952.66631772 131842.9712135  112822.18181622 101086.93054687
 118301.50681434  71009.85605703  53233.70557311 180489.38971798
 186745.58472411 185218.50090047 188952.77742955 104793.87426602
 182026.23015277 171411.35441556 139977.30918956  54321.5132325
  77144.72212927 182702.36147157  72006.95904891 145796.30274076
 191372.89462854 196300.27899095 138867.99987841  70349.162473
 145829.10501337 187745.09275987 180303.89905063  60483.60730333
 134148.63627816  84177.21621617 174412.76236094  99243.69536311
 196053.35086031 131358.55969497  58177.14602235 109411.3435364
  58848.93452494  70073.90248335  55673.50880635  79922.5899983
 109664.06991112  70954.39524067 185751.78113453 152209.84644114
 157912.89010804 120066.6557958  171453.37735048 108569.33060861
 106968.44448784 116535.26832235  61624.86251346  83881.12584394
 132975.38768298 124111.55835972 132437.79150139 135181.5291186
 190045.66408933 111064.2083057  182803.90595472 190100.01143727
 151800.57485002 160644.67233715 172544.67114667 156630.5727489
 171262.4271996   76651.98859374  54964.85705241 177525.89125801
 116166.21311368 177525.39186048  77086.52554981 147684.7906717
 123807.68847082 100561.35291607 102241.56490341 121403.49001771
 174793.18621607 148171.50684806  69765.85078974 104158.02638034
 115862.09306694 132341.31394333  83131.45786416 136910.43791496
  84486.78607144  52365.14274065 121967.38236607  58933.74990423
  95027.72317504  50803.22585184 198847.34237733 180337.45069766
 118299.27944786 141136.49406338 155184.48011322  85439.68294205
 167940.69461681 137529.30436662 180762.78048749 104770.88542106
 108415.32792859 158971.24676925  73352.62467306 151828.98409211
 111075.13597865 191795.01286963 140835.23119222 161923.40505735
 164018.94374803 133417.18911245 131594.16174446 192812.54298159
 109188.6694876  152394.89422372 170006.79032969 197014.56777736
 136945.15128731  67439.77082908  90504.30308147 106038.01868994
 107027.58863567  56724.06744527  59018.74312289  53006.15926843
 153724.22645475 196816.83384493  83679.07329133 129438.98464061
  64721.96953913 174998.71164492 170554.66286679  52667.34414587
 113691.42508183 190710.39927261 144434.39835748 130681.05044337
  96504.82208726  92652.27532531 194703.80985777 150448.83456903
 135708.25435249 112241.45466505  72569.10087893  72360.67191112
 172505.59014638 127653.39398847 125590.85367903 137776.60582198
  76012.27798425  72093.16417593 155496.13366457  72196.50143961]

In [5]:
# Check for any missing values in each column
print(df.isnull().sum())

Name         1023
Age          1033
City            0
Join_Date     998
Salary       2286
Gender       1247
dtype: int64

In [6]:
# Get summary statistics for numerical columns
print(df.describe())

               Age        Salary
count  9067.000000  7.814000e+03
mean     43.918275  3.471742e+06
std      15.406788  4.201636e+06
min      18.000000  1.000000e+01
25%      30.000000  1.000000e+01
50%      44.000000  2.000000e+06
75%      57.000000  9.999999e+06
max      70.000000  9.999999e+06

**Step 3: Handle Missing Values**
- You can either remove rows with missing values or fill them with a default value. Let's handle missing values for each column:

A. Name Column (Missing Values)
- Since `Name` is important, let's remove rows where the name is missing.

In [7]:
# Remove rows where 'Name' is missing
df = df.dropna(subset=['Name'])

B. Age Column (Missing Values)
- For Age, you might want to fill missing values with the mean or median age.

In [9]:
# Fill missing 'Age' values with the median age
df['Age'] = df['Age'].fillna(df['Age'].median())

C. Salary Column (Missing Values)
- For Salary, let's fill missing values with the median salary.

In [10]:
# Fill missing 'Salary' values with the median salary
df['Salary'] = df['Salary'].fillna(df['Salary'].median())

D. Join_Date Column (Missing Values)
- If Join_Date is missing, we can either drop those rows or fill them with a default date.

In [11]:
# Fill missing 'Join_Date' with a default value (e.g., today's date)
df['Join_Date'] = df['Join_Date'].fillna(pd.to_datetime('today'))

In [12]:
df.head()

               Name   Age           City   Join_Date     Salary  Gender
0  Savannah Patrick  21.0  san francisco  2024-02-04  9999999.0    Male
1    Jessica Ramsey  32.0             SF  15/03/2022  9999999.0  Female
2       Jacob White  70.0             LA  2019-11-03  2000000.0  female
3        Erik Ortiz  62.0  San Francisco  2020-06-14       10.0    male
4      Tonya Dudley  42.0             LA  2023-07-21  2000000.0  Female

**Step 4: Fix Inconsistent Data**
- Inconsistent data happens when the same information is represented in different ways (e.g., "male", "Male", "Mmale").

A. Clean Gender Column
- You can fix the gender column by standardizing it to either "Male" or "Female".

In [13]:
# Convert everything to lowercase
df['Gender'] = df['Gender'].str.lower()

In [14]:
# Replace typos and fix the values
df['Gender'] = df['Gender'].replace({
    'mmale': 'male',
    'femle': 'female',
    'femlae': 'female'
})

# Fill any remaining missing values with 'unknown'
df['Gender'] = df['Gender'].fillna('unknown')

B. Clean City Column
- Inconsistent city names (e.g., "New York", "new york", "LA") should be standardized.

In [15]:
# Standardize city names
city_replacements = {
    'new york': 'New York',
    'LA': 'Los Angeles',
    'SF': 'San Francisco',
    'Los Angele': 'Los Angeles',
    'san francisco': 'San Francisco'
}

df['City'] = df['City'].replace(city_replacements)

**Step 5: Handle Outliers**
- Outliers are extreme values that don't make sense. Let's handle the extreme salary values.

A. Salary Column (Outliers)
- Look for very high or very low salaries, and remove or cap them.

In [16]:
# Define the reasonable range for salaries
df = df[df['Salary'] > 20000]  # Remove unrealistic low salaries
df = df[df['Salary'] < 200000]  # Remove unrealistic high salaries

**Step 6: Parse Dates**
- Dates in the Join_Date column may have different formats, so let's convert them to a consistent datetime format.

In [17]:
# Convert the 'Join_Date' column to datetime format
df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors='coerce')

In [18]:
# Check if any invalid dates were converted to NaT (Not a Time)
print(df['Join_Date'].isnull().sum())

88

In [19]:
# Fill any remaining NaT values with a default date
df['Join_Date'] = df['Join_Date'].fillna(pd.to_datetime('2000-01-01'))

**Step 7: Remove Duplicates**
- You might have some duplicated rows in the dataset. Let's remove them.

In [25]:
# Check for duplicated rows and count them
is_duplicated = df.duplicated().sum()

print(f'Total number of duplicated rows: {is_duplicated}')

Total number of duplicated rows: 5

In [26]:
# Remove duplicate rows
df = df.drop_duplicates()

**Step 9: Inspect the Cleaned Data**
- Finally, inspect the cleaned dataset to make sure everything looks correct.

In [28]:
# Check the structure and summary of the cleaned dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 532 entries, 5 to 10073
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       532 non-null    object
 1   Age        532 non-null    float64
 2   City       532 non-null    object
 3   Join_Date  532 non-null    datetime64[ns]
 4   Salary     532 non-null    float64
 5   Gender     532 non-null    object
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 29.1+ KB

In [29]:
# Display the first few rows of the cleaned data
print(df.head())

                Name   Age           City  Join_Date         Salary   Gender
5    Danielle Ingram  56.0       New York 2020-08-21  173314.071782   female
29    Amanda Hendrix  18.0    Los Angeles 2021-06-07   81495.406548     male
73     Jacob Gardner  20.0       New York 2022-02-13   55726.338826  unknown
108       Mark Ochoa  29.0  San Francisco 2024-01-11  199014.301988  unknown
117     Carlos Bauer  51.0  San Francisco 2022-09-19   76552.655846   female

In [30]:
# Check for any missing values in each column
print(df.isnull().sum())

Name         0
Age          0
City         0
Join_Date    0
Salary       0
Gender       0
dtype: int64

In [31]:
# Check for duplicated rows and count them
is_duplicated = df.duplicated().sum()

print(f'Total number of duplicated rows: {is_duplicated}')

Total number of duplicated rows: 0

In [32]:
df.head()

                Name   Age           City  Join_Date         Salary   Gender
5    Danielle Ingram  56.0       New York 2020-08-21  173314.071782   female
29    Amanda Hendrix  18.0    Los Angeles 2021-06-07   81495.406548     male
73     Jacob Gardner  20.0       New York 2022-02-13   55726.338826  unknown
108       Mark Ochoa  29.0  San Francisco 2024-01-11  199014.301988  unknown
117     Carlos Bauer  51.0  San Francisco 2022-09-19   76552.655846   female

**Bonus: Save the Cleaned Data**
- You can save the cleaned data to a new CSV file.

In [38]:
# Save the cleaned data
df.to_csv('cleaned_data.csv', index=False)